int main() {
 int a = 14, b;
int res = 0;
  for (int i = 2; i < a; i++) //поскольку мы не можем начинать проверку с деления на 0 или 1 поскольку все числа делятся на 1 начинаем с 2
    {
    if (b = a % i) {
    }
    else (b == 1); { 
    }
    if( res == 0);
 
  }
  return 0; 
}

//
int i = 2;

while(i < a) {
	if (a > b){ //от переменной а должно отниматься b до того момента пока а не будет равна b
	a = a-b; 
	NOD = a;
	}
else{  //oт переменной b должна отниматься переменная a, до того момента пока переменная а не будет равна переменной b
	b = b-a; 
	NOD = b;
	}
	
	

	
  return 0;
  }


  
 /*int main()
int a = 13;
 int b;
 int res = 0;
 for (int i = 2; i < a; i++) {
 if (a%i == 0){
 res = i; 
 }
 
 }
  else(res == 1){
  res =1;
  
  }
return 0;
int main() {
 int a = 13, b;
  bool res;
  
  res = true; // true - простое число, false - не простое
  for (int i = 2; i < a; i++) //поскольку мы не можем начинать проверку с деления на 0 или 1 поскольку все числа делятся на 1 начинаем с 2
    {
    b = a % i;
    if (b == 0) { 
    res = false; break; }
  }
  return 0;
}*/
